temp_data1 = [{
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "보안책임자",
        "리뷰 내용": "음식이 맛있어서 자주 오는데 한결같이 사장님이 친절하시고 너무 맛있어요~!! 요즘 추운데 따뜻한 국물에 소주 끝도 없이 들어가요 데이트로도 좋고 친구랑 한잔 하기도 좋아요 추천합니다 ㅎㅎ 역이랑도 가깝고 안에 따뜻해서 좋아용",
        "작성일": "11.24.일",
        "재방문 여부": "3번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "민영7651",
        "리뷰 내용": "몇 번왔는지 기억도 안날만큼 제 또또또또또간집인데요.오늘도 역시 맛있어요! 닭도리탕에 대창추가가 양이 딱입니다 ㅎㅎ 주먹밥도 꼭 드세요",
        "작성일": "11.22.금",
        "재방문 여부": "4번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "bby****",
        "리뷰 내용": "곱도리탕이 먹고 싶어서 급 방문 하게 된 곳 인데 들어오자마자 너무 예쁘고 낭만 있어서 좋았어용!!😍❤️ 가게도 시끄럽지 않고 분위기 너무 좋아서 나중에 또 방문 할 거 같아요! 맛도 기대 이상으로 너무 최고..😚❤️ 직원분들도 친절하셔서 좋아용!",
        "작성일": "11.17.일",
        "재방문 여부": "1번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "보안책임자",
        "리뷰 내용": "신촌 오면 생각나서 꼭 들르는 곳이에요 날씨가 추워지니 더 맛있는 거 같아요 소주에 한잔 하는거 좋아해서 오는데 국물 칼칼하고 소주도둑이에요💕 매콤하고 깔끔한 맛 좋아하시면 추천합니다 토핑도 알차고 든든해서 재방문 의사 있습니다!",
        "작성일": "11.16.토",
        "재방문 여부": "2번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "Sooj53",
        "리뷰 내용": "착한 가격에 대화하기 좋은 신촌가성비 술집💕염통 부드럽고 맛있어요 👍👍👍👍",
        "작성일": "11.22.금",
        "재방문 여부": "1번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "안냥하세뇽",
        "리뷰 내용": "대화하기 좋아요 !! 근처 술집 너무 붐벼서 시끄러운데여기는 데이트하기 딱 좋아요 -!! 그리고 안주가 너무나 맛있습니다 오돌뼈 진짜 너무 맛있어요알바끝나고 들리기 딱 좋아요:)메뉴도 가성비있고 사장님도 친절하세요 !-!",
        "작성일": "11.19.화",
        "재방문 여부": "1번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "fre****",
        "리뷰 내용": "곱도리탕 맛집!! 살얼음소주와 생맥도 저렴하게 판매하시는 신촌 최고 술집입니다 ㅎㅎ 곱도리탕은 거의 전문점 급 맛집이고, 넓은 매장에 테이블 간격도 멀어서 주변 테이블 시끄러운 소리가 덜 들려서 좋았어요! 사장님 너무 친절하시고요 ㅎㅎ 센스 있으신 사장님께서 계란고봉밥을 메뉴에 넣어주셔서 계란후라이까지 슥삭 밥 한그릇 먹었습니다! 시원한 맥주는 덤 ㅎㅎ신촌 술집으로 왕추천드리고 자리가 널널해서 단체도 충분할것 같아요! 추천합니다!!!",
        "작성일": "10.3.목",
        "재방문 여부": "1번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "옹오이",
        "리뷰 내용": "레트로분위기부터 재료 아낌없이 넣은 곱도리탕까지 너무 맛있고 재밌게 먹다왔어요!! 홀도 있고 생일파티할 수 있는 프리이빗한 룸도 있다고 하니까 다음에는 룸 예약해서 가보려규요😆 소주 3900에 계속 팔아주세요 사장님💗💗💗",
        "작성일": "10.23.수",
        "재방문 여부": "1번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "yun****",
        "리뷰 내용": "한우곱도리탕 먹었는데 너무 맛있어요~~대창 곱창에 닭고기까지 다양하게 들어가 있어서 좋았고 맵찔이인데 1단계 국물맛 딱 좋았어요!후식으로 치즈날치알 볶음밥도 추천해요하이볼도 위스키가 많이 들어있는 찐 하이볼이라 만족했어요~",
        "작성일": "8.18.일",
        "재방문 여부": "1번째 방문"
    },
    {
        "가게 이름": "역전포장마차 신촌점",
        "닉네임": "drjacknone",
        "리뷰 내용": "조명이 노래서 사진이 예쁘게 안나오네요ㅠㅜ 안주 맛있고 분위기도 추억+힙 중간 어딘가..!ㅎㅎ 즐거운 저녁이에요",
        "작성일": "11.6.수",
        "재방문 여부": "1번째 방문"
    }]

sentences = [review["리뷰 내용"] for review in temp_data1]

'''
하나의 문장 혹은 문서에서 보다는 어느 정도 규모가 있는 동일한 집단의 문서 (homogeneous documents) 에서 잘 작동합니다.
영화 댓글들이나 하루의 뉴스 기사처럼 같은 단어를 이용하는 집합의 문서만 모아서 Extractors 를 학습하시면 좋습니다.
이질적인 집단의 문서들은 하나로 모아 학습하면 단어가 잘 추출되지 않습니다.
'''

with open("temp_sentences.txt", "w", encoding="utf-8") as f:
    for sentence in sentences:
        f.write(sentence + "\n\n")
# from soynlp.noun import NewsNounExtractor
# noun_extractor = NewsNounExtractor()
# nouns = noun_extractor.train_extract(sentences) # list of str like
# print(f"\n nouns2:{nouns.keys()}") ## 또간집은 못뽑아 but 곱도리탕은 뽑아

from soynlp.utils import DoublespaceLineCorpus
from soynlp.noun import LRNounExtractor_v2
# corpus_path = " ".join(sentences)
corpus_path = "temp_sentences.txt"
sents = DoublespaceLineCorpus(corpus_path,iter_sent=True)
noun_extractor = LRNounExtractor_v2(verbose=True, extract_compound=True)

noun_extractor.train(sents)
nouns = noun_extractor.extract()

print(nouns.keys())

# 복합명사 뽑는 함수 
print(list(noun_extractor._compounds_components.items())[:10])
# noun_extractor = LRNounExtractor_v2(verbose=True, extract_compound=True)
# noun_extractor.train_extract(sents)
# print(list(noun_extractor._compounds_components.items())[:10])

print(noun_extractor.decompose_compound('또또또또또간집인데요'))